# St7GetLibraryPath

Returns the full path name to the directory containing the Strand7 library files.

long St7GetLibraryPath(char* LibraryPath, long MaxStringLen)

Input Parameters

MaxStringLen

The maximum number of characters allocated for LibraryPath.

Output Parameters
LibraryPath

Full path name to the directory containing the Strand7 library files.